#+TITLE: Halpha-emitters-stars
** Match

   We need to include in the table of SDSS and Lamost the ID SPLUs.
   
#+name: match-code
#+BEGIN_SRC python :results output
  
  def tables(table1, table2):
      import numpy as np
      from astropy.table import Table, vstack, Column, MaskedColumn
      import astropy.coordinates as coord
  
      #Using ll-stars-arcs-simbad-047.ecsv on which was used a searched radi of 0.47 arcsec
      tab1 = Table.read(table1, format="ascii.ecsv")
  
      print("Number of sources:", len(tab1))
  
      # Read the table with the arcs
      tab2 = Table.read(table2, format='ascii.ecsv')

      print("Number of sources with spectra:", len(tab2))

      tab1['coord'] = coord.SkyCoord(ra=tab1['RA'], dec=tab1['DEC'],
				     unit=('deg', 'deg'))
  
      cols = ['ID', 'RA', 'DEC', 'Sep'] 
  
      tab2['coord'] = coord.SkyCoord(ra=tab2['RA'], dec=tab2['DEC'],
					 unit=('deg', 'deg'))
      seps = []
      for arcs in tab1:
          sep = arcs['coord'].separation(tab2['coord']).arcsec
          sepmin_i = sep.argmin()
          seps.append(sep[sepmin_i])
      tab1["Sep"] = seps
      m = np.array(seps) <= 2.0

      return tab1[m][cols]
  
#+END_SRC

#+RESULTS: match-code

#+BEGIN_SRC python :results output :noweb yes
  <<match-code>>  
  tab = tables("iDR3_n4/Star-v3/Halpha-DR3_PStotal-STAR_total-clean-Final.ecsv",
		   "iDR3_n4/Star-v3/SDSS-spectra/spectra-information.ecsv")
  print("Number the objects with match:", len(tab))
  tab.write('iDR3_n4/Star-v3/SDSS-spectra/spectra-information-id.ecsv', format='ascii.ecsv',
		   overwrite=True)
#+END_SRC

#+RESULTS:
: Number of sources: 3187
: Number of sources with spectra: 166
: Number the objects with match: 166

#+BEGIN_SRC python :results output :noweb yes
  <<match-code>>  
  tab = tables("iDR3_n4/Star-v3/Halpha-DR3_PStotal-STAR_total-clean-Final.ecsv",
        "iDR3_n4/Star-v3/Lamots-spectra/spectra-information-lamost.ecsv")
  print("Number the objects with match:", len(tab))
  tab.write('iDR3_n4/Star-v3/Lamots-spectra/spectra-information-lamost-id.ecsv', format='ascii.ecsv',
	overwrite=True)
#+END_SRC

#+RESULTS:
: Number of sources: 3187
: Number of sources with spectra: 61
: Number the objects with match: 48

The real number of spectra is 48.

** SIMBAD

From the SIMBAD table I need take out the SDSS and Lamost list.

#+BEGIN_SRC python :results output
  import numpy as np
  import pandas as pd
  from astropy.table import Table, vstack, Column, MaskedColumn
  
  # Table 1
  df = pd.read_csv("iDR3_n4/Star-v3/Halpha-DR3_PStotal-STAR_total-clean-Final-simbad.csv")
  # Converting pandas into astropy
  tab = Table.from_pandas(df)
  
  # Tables SDSS and LAMOST
  tab_sdss = Table.read("iDR3_n4/Star-v3/SDSS-spectra/spectra-information-id.ecsv", format="ascii.ecsv")
  tab_lamost = Table.read("iDR3_n4/Star-v3/Lamots-spectra/spectra-information-lamost-id.ecsv", format="ascii.ecsv")
  # Join
  tab_final = vstack([tab_sdss, tab_lamost])
  
  # Making mask and applying
  idd1 = []
  for i in tab:
      if i["ID"].endswith(" '"):
	id1 = i["ID"].split("b'")[-1].split(" ")[0]
	idd1.append(id1)
      else:
	id1 = i["ID"].split("b'")[-1].split("'")[0]
	idd1.append(id1)
  
  idd2 = []
  for i in tab_final:
      if i["ID"].endswith(" '"):
	id2 = i["ID"].split("b'")[-1].split(" ")[0]
	idd2.append(id2)
      else:
	id2 = i["ID"].split("b'")[-1].split("'")[0]
	idd2.append(id2)
  
  mask = np.array([not source in idd2 for source in idd1])
  print("Number of simbad objecs:", len(tab))
  print("Number of spectra objecs:", len(tab_final))
  print("Number of reamainder objects:", len(tab[mask]))
  tab[mask].write("iDR3_n4/Star-v3/Halpha-DR3_PStotal-STAR_total-clean-Final-simbad-nonspectra.ecsv", format="ascii.ecsv", overwrite=True)
  
  
#+END_SRC

#+RESULTS:
: Number of simbad objecs: 417
: Number of spectra objecs: 214
: Number of reamainder objects: 257
   
 I took out the objects in SIMBAD table that have SDSS and Lamost spectra. The final file is:

: iDR3_n4/Star-v3/Halpha-DR3_PStotal-STAR_total-clean-Final-simbad-nonspectra.ecsv

Now we count the objects by redshift range.

#+BEGIN_SRC python :results output
  from astropy.table import Table, vstack
  import pandas as pd
  from pathlib import Path
  import numpy as np


  ROOT_PATH = Path("paper/Figs")
  
  tab = Table.read("iDR3_n4/Star-v3/Halpha-DR3_PStotal-STAR_total-clean-Final-simbad-nonspectra.ecsv", format="ascii.ecsv")
  print(tab.columns)

  #How many are the local universe
  liml_z = tab["redshift"] <= 0.02
  limu_z = tab["redshift"] > 0.02

  print("Number the objects:", len(tab))
  print("Number the objects with z < 0.02:", len(tab[liml_z]))
  print("Number the objects with z > 0.02:", len(tab[limu_z]))

#+END_SRC

#+RESULTS:
: <TableColumns names=('Field','ID','RA','DEC','FWHM','ISOarea','KRON_RADIUS','MU_MAX','nDet_PStotal','PhotoFlagDet','CLASS_STAR','u_PStotal','J0378_PStotal','J0395_PStotal','J0410_PStotal','J0430_PStotal','g_PStotal','J0515_PStotal','r_PStotal','J0660_PStotal','i_PStotal','J0861_PStotal','z_PStotal','e_u_PStotal','e_J0378_PStotal','e_J0395_PStotal','e_J0410_PStotal','e_J0430_PStotal','e_g_PStotal','e_J0515_PStotal','e_r_PStotal','e_J0660_PStotal','e_i_PStotal','e_J0861_PStotal','e_z_PStotal','r - i','r - J0660','e(r - i)','e(r - J0660)','P(GoodPho)','P(BadPho)','main_id','ra_x','dec_x','coo_err_maj','coo_err_min','coo_err_angle','nbref','ra_sexa','dec_sexa','coo_qual','coo_bibcode','main_type','other_types','radvel','radvel_err','redshift','redshift_err','sp_type','morph_type','plx','plx_err','pmra','pmdec','pm_err_maj','pm_err_min','pm_err_pa','size_maj','size_min','size_angle','B','V','R_x','J','H','K','u','g','r_xa','i','z','angDist')>
: Number the objects: 257
: Number the objects with z < 0.02: 130
: Number the objects with z > 0.02: 127

+ In total 206+33+168=407 objects have with high redshift (SDSS, LAMOST, SIMBAD). 
